## `terraform/scheduling`
#### Terraform Format and Style 🖌`failure`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
data.aws_iam_role.task_role: Reading...
data.aws_vpc.myvpc: Reading...
data.aws_efs_file_system.my_efs: Reading...
module.custom_domain.data.aws_route53_zone.mydomain: Reading...
data.aws_sns_topic.my_sns: Reading...
data.aws_security_group.fargate_sg: Reading...
data.aws_iam_role.task_execution_role: Reading...
module.custom_cloudwatch.aws_cloudwatch_log_group.firelens: Refreshing state... [id=/aws/ecs/minecraft-firelens-logs]
module.custom_ecs.aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:528163014577:cluster/minecraft-test-cluster]
data.aws_iam_role.task_execution_role: Read complete after 0s [id=minecraft-test-ecs_tasks_execution-role]
data.aws_iam_role.task_role: Read complete after 0s [id=ecs_tasks-minecraft-test-role]
data.aws_sns_topic.my_sns: Read complete after 0s [id=arn:aws:sns:ap-northeast-1:528163014577:minecraft-test-sns-topic]
module.custom_domain.data.aws_route53_zone.mydomain: Read complete after 0s [id=Z0885897H6FS59VX1SAQ]
data.aws_security_group.fargate_sg: Read complete after 0s [id=sg-021594a535f976e96]
data.aws_efs_file_system.my_efs: Read complete after 1s [id=fs-0f3060484a112498b]
module.custom_ecs.aws_ecs_task_definition.main: Refreshing state... [id=minecraft-test]
data.aws_vpc.myvpc: Read complete after 1s [id=vpc-0e5468f3c81240453]
data.aws_subnets.my_subnets: Reading...
module.custom_nlb.module.nlb.aws_lb_target_group.main[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:528163014577:targetgroup/tf-20230927133633796400000001/d6f7552e8b9b27b6]
data.aws_subnets.my_subnets: Read complete after 0s [id=ap-northeast-1]
module.custom_nlb.module.nlb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:528163014577:loadbalancer/net/minecraft-test-nlb/f3eea244fca6bae1]
module.custom_ecs.aws_ecs_service.main: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:528163014577:service/minecraft-test-cluster/minecraft-test-service]
module.custom_domain.aws_route53_record.apps_dns: Refreshing state... [id=Z0885897H6FS59VX1SAQ_minecraft.smat710.tk_A]
module.custom_nlb.module.nlb.aws_lb_listener.frontend_http_tcp[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:528163014577:listener/net/minecraft-test-nlb/f3eea244fca6bae1/f3b3d4d470f2f788]
module.custom_cloudwatch.aws_cloudwatch_metric_alarm.task_running_count: Refreshing state... [id=minecraft-test-task_running_count]
module.custom_cloudwatch.aws_cloudwatch_metric_alarm.memory_utilization: Refreshing state... [id=minecraft-test-memory_utilization]
module.custom_cloudwatch.aws_cloudwatch_metric_alarm.cpu_utilization: Refreshing state... [id=minecraft-test-cpu_utilization]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.custom_ecs.aws_ecs_service.main will be updated in-place
  ~ resource "aws_ecs_service" "main" {
        id                                 = "arn:aws:ecs:ap-northeast-1:528163014577:service/minecraft-test-cluster/minecraft-test-service"
        name                               = "minecraft-test-service"
        tags                               = {}
      ~ task_definition                    = "minecraft-test:26" -> "minecraft-test"
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.custom_ecs.aws_ecs_task_definition.main must be replaced
-/+ resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-1:528163014577:task-definition/minecraft-test:26" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-northeast-1:528163014577:task-definition/minecraft-test" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                    name             = "minecraft"
                  - volumesFrom      = [] -> null
                    # (7 unchanged elements hidden)
                },
              ~ {
                  - environment           = [] -> null
                    name                  = "firelens_log_router"
                  - portMappings          = [] -> null
                  - volumesFrom           = [] -> null
                    # (7 unchanged elements hidden)
                },
            ]
        )
      ~ id                       = "minecraft-test" -> (known after apply)
      ~ revision                 = 26 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (8 unchanged attributes hidden)

      - volume { # forces replacement
          - name = "data" -> null

          - efs_volume_configuration {
              - file_system_id          = "fs-0f3060484a112498b" -> null
              - root_directory          = "/" -> null
              - transit_encryption      = "DISABLED" -> null
              - transit_encryption_port = 0 -> null

              - authorization_config {
                  - iam = "DISABLED" -> null
                }
            }
        }
      + volume { # forces replacement
          + name = "data"

          + efs_volume_configuration {
              + file_system_id          = "fs-0f3060484a112498b"
              + root_directory          = "/"
              + transit_encryption      = "ENABLED"
              + transit_encryption_port = 2999

              + authorization_config {
                  + iam = "DISABLED"
                }
            }
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```

</details>